/** ЗАДАЧА 25 - Выражение или инструкция
 *
 * Определите тип каждой конструкции JavaScript:
 *  - выражение (expression)
 *  - инструкция (statement)
 *  - выражение-инструкция (expression statement)
 */

15 // выражение-инструкция

const myObject /** инструкция */ = {
  x: 10,
  y: true,
} // выражение

myObject.z /** выражение-инструкция */ = 'abc' // выражение

delete myObject.x // выражение-инструкция

let newVariable // инструкция

newVariable /** выражение-инструкция */ = 30 + 5 // выражение

console.log(newVariable /** выражение */) // выражение-инструкция

if (newVariable > 10 /** выражение */) {
  console.log(`${newVariable/** выражение */} больше 10` /** выражение */)// выражение-инструкция
}// инструкция
