/** ЗАДАЧА 63 - Зона видимости функции
 *
 * Что будет выведено в консоль?
 * Ответьте на вопрос без запуска кода
 */

const b = 2
let d = 15

function myFn1(a) {
  let b // Объявляет переменую в новой зоне видимости myFn1
  let d = 10
  myFn2(b) // Передаём переменную b
}

// Если перенести объявление функции в тело функции myFn1, то её область видимости сменится, а переменные объявленный внутри myFn1 переназначатся для myFn2
function myFn2(a) {
  let c = 5
  console.log(a, b, c, d) // Выведет переданное значение a = Undefined, затем переменную объявленную в глобальной зоне видимости myFn1 b = 2, затем переменную объявленную в зоне видимости myFn2 с = 5, затем переменную объявленную в глобальной зоне видимости myFn1 d = 15
}

myFn1()
